Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/seanad_university_constituency.html.txt.tmx
Source language: en
Languages: ga

source: Seanad - the University Constituency
ga: Seanad - Toghcheantar na nOllscoileanna

source: The National University of Ireland (NUI) can elect 3 members to the Seanad
ga: Is féidir le Ollscoil na hÉireann (OÉ) triúr a thoghadh don Seanad

source: The NUI consists of:
ga: Seo a leanas coláistí OÉ:

source: • National University of Ireland, Galway
ga: • Ollscoil na hÉireann, Gaillimh

source: • National University of Ireland, Maynooth
ga: • Ollscoil na hÉireannl, Mhá Nuad

source: The NUI also awards degrees in a number of other colleges
ga: Bronnann OÉ céimeanna i roinnt coláistí eile freisin

source: The graduates of these "recognised colleges" with NUI awards may also vote in the Seanad elections
ga: Is féidir le céimithe "na gcoláistí aitheanta seo" vóta a chaitheamh i dtoghcháin an tSeanaid chomh maith

source: The recognised colleges are:
ga: Seo a leanas na coláistí aitheanta:

source: • Royal College of Surgeons
ga: • Coláiste Ríoga na Máinlianna

source: • National College of Art and Design
ga: • Coláiste Náisiúnta Ealaíne agus Deartha

source: • Shannon College of Hotel Management
ga: • Coláiste Bainistíocht Óstáin na Sionainne

source: There are also formerly recognised colleges
ga: Tá coláistí a raibh aitheantas acu tráth ann freisin

source: Graduates of these colleges who hold an NUI award may also vote in the Seanad elections
ga: Céimithe de na coláistí seo a bhfuil céim OÉ acu is féidir leo vóta a chaitheamh i dtoghcháin an tSeanaid

source: Formerly recognised colleges include:
ga: I measc na gcoláistí a raibh aitheantas acu tá:

source: • St. Patrick's College, Maynooth (now the University of Maynooth)
ga: • Coláiste Naomh Phádraig, Má Nuad (Ollscoil Mhá Nuad anois)

source: • Our Lady of Mercy College, Carysfort
ga: • Coláiste Naomh Mhuire na Trócaire

source: • Mary Immaculate College of Education, Limerick (now a college of the University of Limerick)
ga: • Coláiste Naomh Mhuire Gan Smál, Luimneach (atá anois ina choláiste d'Ollscoil Luimnigh)

source: • St. Patrick's College of Education, Drumcondra (now a college of Dublin City University)
ga: • Coláiste Oideachais Naomh Phádraig, Drom Conrach (atá anois ina choláiste d'Ollscoil Chathair Bhaile Átha Cliath)

source: • NIHE, Limerick (now the University of Limerick)
ga: • INAO, Luimneach (Ollscoil Luimnigh anois)

source: • Thomond College of Education, Limerick (now part of the University of Limerick)
ga: • Coláiste Thuaidh Mhumhan, Luimneach (atá anois mar chuid d'Ollscoil Luimnigh)

source: • St Angela's College of Education, Sligo
ga: • Coláiste Oideachais Naomh Aingeal, Sligeach

source: A list of the institutions in the NUI Seanad Éireann constituency is available on nui.ie
ga: Tá liosta institiúidí sa toghcheantar Seanaid Éireann ar fáil ar nui.ie

source: University of Dublin (Trinity College)
ga: Ollscoil Bhaile Átha Cliath (Coláiste na Tríonóide)

source: The University of Dublin may also elect 3 members of the Seanad
ga: Is féidir le hOllscoile Bhaile Átha Cliath triúr a thoghadh don Seanad

source: This means that graduates of Trinity College may vote in the election
ga: Mar sin is féidir le céimithe de Choláiste na Tríonóide vóta a chaitheamh sa toghchán

source: There are also a number of other colleges that award University of Dublin degrees, including the Dublin Institute of Technology
ga: Tá roinnt coláistí eile a bhronnann céimeanna ó Ollscoil Bhaile Átha Cliath, ina measc Institiúid Teicneolaíochta Bhaile Átha Cliath

source: Graduates of these colleges who hold a University Of Dublin degree may also vote in the Seanad election
ga: Is féidir le céimithe na gcoláistí sin a bhfuil céim acu ó Ollscoil Bhaile Átha Cliath vóta a chaitheamh i dtoghcháin an tSeanaid
